
::设置命令行自身的显示与否
::@echo {on|off}
@echo off

::设置cmd窗口的标题
title TestBAT

::输出字符串
::echo str
echo This is the First Class

::输出换行(注意.与echo间没有空格)
echo.

::输出str后换行(printf)
echo.|echo printf
echo =========

::del fileName.expName
::删除文件,*.*为删除所有文件
::del nothing.txt

::覆写文件
::echo content>fileName
echo @echo off>newFile.bat
::向文件尾追加
::echo content>>fileName
echo echo newStr>>newFile.bat
echo pause>>newFile.bat

echo.
::显示文件内容
type newFile.bat
echo.

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

::设置变量
::set [command] varOperation
::	command:/a让set支持数学运算 /p接收输入数据 /?帮助

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

::goto语句
:flag
set /a var+=1
echo %var%
if %var% leq 3 goto flag
echo.
::对着段代码的理解是:set指定一个变量的值,%var%取得var当前值,leq是小等于

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

::打开文件或文件夹
::start newFile.bat
::start C:\
::调用图形界面打开D盘start explorer d:\

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

::新建文件夹
::md newFolder
::cd newFolder

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

::ATTRIB 显示或更改文件属性
::ATTRIB [+R|-R] [+A|-A] [+S|-S] [+H|-H] [[drive:] [path] filename] [/S [/D]]
::+设置属性 -清除属性
::R只读文件属性 A存档文件属性 S系统文件属性 H隐藏文件属性
echo content>fileForAttrib.txt
attrib +r fileForAttrib.txt
::echo echo newStr>>fileForAttrib
::追加失败,因为改文件为只读;编辑该文件后在保存时,会提示无法保存

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

::批处理运行命令的预读机制
set a=4
set a=5 & echo %a%
::先把这一句整句读取并做了预处理,对变量a赋了值,那么%a%当然就是4了

::setlocal 与 变量延迟
setlocal enabledelayedexpansion
set a=4
set a=5 & echo !a!
::"setlocal enabledelayedexpansion" 启动变量延迟
::!a! 对于需要变量延迟操作的变量,不再用%a%,而是!a!
::由于启动了变量延迟,所以批处理能够感知到动态变化,即不是先给该行变量赋值,而是在运行过程中给变量赋值,因此此时a的值就是5了
echo.

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

::for循环
::命令格式 FOR [command-parameters] %%variable IN (set) DO command
::for %%i in(1,1,5) do echo %i%
setlocal enabledelayedexpansion
for /l %%i in (1,1,5) do (
	set a=%%i
	echo !a!
)
echo.

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

::打印当前路径
setlocal EnableDelayedExpansion
echo !cd!
::dir !cd!
echo.


:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::	1.@		命令行回显屏蔽符

::	2.%		批处理变量引导符,引用变量用%var%,调用程序外部参数用%1至%9

::	3.>		重定向符

::	4.>>	重定向符

::	5.<、>&	重定向符(不常用),可被^转义

::	6.|		命令管道符,格式: 第一条命令|第二条命令[|第三条命令...],将第一条命令的结果作为第二条命令的参数来使用
	dir c:\|find "txt"
	::查找C:\下所有文件,并发现文件名带有"txt"字符串的文件

::	7.^		转义字符,续行符号
	echo test ^>newFile.txt
	::<、>&遇到^作为前导符时将被取消特殊功能
	echo A^
	B^
	C
	::以^结尾的句子被看做是上行的续行

::	8.&,&&,||	组合命令
	::&顺序执行两边命令,单条命令失败不影响后面命令的执行
	::&&顺序执行,一旦出现单条命令失败,终止执行(与)
	::||顺序执行,只要出现一条命令成功,终止执行(或)

::	9.;	当命令相同时,可以将不同目标用；来隔离,但执行效果不变
	::dir c:\ ; d:\

::	10.()	将多行命令看成一条命令来执行,常用语循环和分支中
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


echo.
pause
